RayceRossum/wifi-densepose/firmware/esp32-mesh-gateway/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# WiFi
CONFIG_ESP_WIFI_MODE_STA=y

# ESP-MESH
CONFIG_MESH_ENABLE=y

# Use custom partition table for NVS
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial output
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Increase main task stack for mesh operations
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Mesh gateway Kconfig defaults
CONFIG_MESH_CHANNEL=6
CONFIG_MESH_AP_MAX_CONNECTIONS=6
CONFIG_MESH_MAX_LAYER=6
CONFIG_MESH_ROUTER_SSID="wifi-densepose"
CONFIG_MESH_ROUTER_PASSWORD=""
CONFIG_MESH_AP_PASSWORD="meshpassword"
CONFIG_MESH_AGGREGATOR_IP="192.168.8.100"
CONFIG_MESH_AGGREGATOR_PORT=5005
